html/20231130T065309--fetch-and-pull-changes-automatically__git_wsl.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>fetch and pull changes automatically</title>
<link rel="stylesheet" href="../css/style.css"/></head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">14 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231130T065309--fetch-and-pull-changes-automatically__git_wsl.html">fetch and pull changes automatically</a></h1>
<p>
This is mainly important when you are working ont he same repo on two different
machines. You make changes on one, then login to another one - you must always
rememebr to pull those changes, otherwise if you make your own - you will get
into merge conflicst. And as of <span class="timestamp-wrapper"><span class="timestamp">[2023-12-14 Thu] </span></span> I am not so good at solving
those. So I try to avoid them as much as possible.
</p>

<p>
This is the reason I am creating this script that will automatically run <code>git
fetch &amp;&amp; git pull</code> that command for me whenever I turn on the WSL.
</p>

<p>
The script example:
</p>

<div class="org-src-container">
<pre class="src src-bash">#!/bin/bash
REPO_DIR="$HOME/GIT/notes/"

function auto-fetch-pull() {
    if [ -d "$1" ]; then
        cd "$1" || exit
        echo "Fetching latest changes..."
        git fetch
        echo "Pulling changes into your branch..."
        git pull
    else
        echo "Directory '$1' not found."
    fi
}

auto-fetch-pull "$REPO_DIR"
</pre>
</div>

<p>
Ensure the script has execute permissions:
</p>
<div class="org-src-container">
<pre class="src src-bash">chmod +x auto_fetch_pull.sh
</pre>
</div>

<p>
Then, try running the script:
</p>
<div class="org-src-container">
<pre class="src src-bash">./auto_fetch_pull.sh
</pre>
</div>

<p>
Add the script execution to your .bashrc
</p>
<div class="org-src-container">
<pre class="src src-bash">echo '~/.emacs.d/MISC/auto_fetch_pull.sh' &gt;&gt; ~/.bashrc
</pre>
</div>

<p>
Each time WSL (or any other linux distribution launches) launches, one of the
thing it does that concern us in this case, is it runs <code>source .bashrc</code>.
Basically evaluates and applies everything that it sees in <code>.bashrc</code> file. And
since we have conveniently placed our script into .bashrc with the last
command - it will run the script each time WSL is launched.
</p>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-git.html">git</a> <a href="https://arvydasg.github.io/devnotes/html/tag-wsl.html">wsl</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
